Public Attributes | List of all members
API_AssemblySegmentProfileData Struct Reference
Element Manager API
Represents an segment of the beam element. More...
#include <APIdefs_Elements.h>
 Public Attributes
UInt32  | segmentIndex
Index of the segment.
ProfileVectorImage *  | customOrigProfile
Original custom profile.
ProfileVectorImage *  | stretchedProfile
Stretched profile.
Detailed Description
Represents an segment of the beam element.
Member Data Documentation
◆ customOrigProfile
 API_AssemblySegmentProfileData::customOrigProfile
Original custom profile.
◆ segmentIndex
 API_AssemblySegmentProfileData::segmentIndex
Index of the segment.
◆ stretchedProfile
 API_AssemblySegmentProfileData::stretchedProfile
Stretched profile.